{"_name_or_path": "av_hubert_hf", "activation_dropout": 0.0, "activation_function": "relu", "adapter_attn_dim": null, "adapter_kernel_size": 3, "adapter_stride": 2, "add_adapter": false, "apply_spec_augment": true, "architectures": ["AV2TextForConditionalGeneration"], "attention_dropout": 0.1, "audio_dropout": 0.5, "audio_feat_dim": 104, "bos_token_id": 1, "classifier_proj_size": 256, "codevector_dim": 256, "contrastive_logits_temperature": 0.1, "conv_bias": false, "conv_channels": 1024, "conv_dim": [512, 512, 512, 512, 512, 512, 512], "conv_kernel": [10, 3, 3, 3, 3, 2, 2], "conv_kernel_sizes": [5, 5], "conv_stride": [5, 2, 2, 2, 2, 2, 2], "ctc_loss_reduction": "sum", "ctc_zero_infinity": false, "d_model": 1024, "decoder_attention_heads": 8, "decoder_ffn_dim": 4096, "decoder_layerdrop": 0.0, "decoder_layers": 9, "decoder_start_token_id": 2, "diversity_loss_weight": 0.1, "do_stable_layer_norm": false, "dropout": 0.1, "dropout_features": 0.1, "dropout_input": 0.1, "encoder_attention_heads": 16, "encoder_embed_dim": 1024, "encoder_ffn_dim": 2048, "encoder_layerdrop": 0.0, "encoder_layers": 12, "eos_token_id": 2, "feat_extract_activation": "gelu", "feat_extract_norm": "group", "feat_proj_dropout": 0.1, "feat_quantizer_dropout": 0.0, "feature_grad_mult": 0.1, "final_dim": 256, "final_dropout": 0.0, "freeze_feat_extract_train": true, "hidden_act": "gelu", "hidden_dropout": 0.1, "init_std": 0.02, "initializer_range": 0.02, "input_channels": 1, "input_feat_per_channel": 80, "intermediate_size": 4096, "is_encoder_decoder": true, "label_rate": 25, "layer_norm_eps": 1e-05, "layerdrop": 0.0, "logit_temp": 0.1, "mask_channel_length": 10, "mask_channel_min_space": 1, "mask_channel_other": 0.0, "mask_channel_prob": 0.0, "mask_channel_selection": "static", "mask_feature_length": 10, "mask_feature_min_masks": 0, "mask_feature_prob": 0.0, "mask_length_audio": 10, "mask_length_image": 5, "mask_min_space": 1, "mask_other": 0.0, "mask_prob_audio": 0.8, "mask_prob_image": 0.3, "mask_selection": "static", "mask_time_length": 10, "mask_time_min_masks": 2, "mask_time_min_space": 1, "mask_time_other": 0.0, "mask_time_prob": 0.0, "mask_time_selection": "static", "masking_type": "input", "max_source_positions": 6000, "max_target_positions": 2048, "modality_dropout": 0.5, "modality_fuse": "concat", "model_type": "speech_to_text", "no_mask_channel_overlap": false, "no_mask_overlap": false, "no_mask_time_overlap": false, "num_adapter_layers": 3, "num_classes": 2004, "num_codevector_groups": 2, "num_codevectors_per_group": 320, "num_conv_layers": 2, "num_conv_pos_embedding_groups": 16, "num_conv_pos_embeddings": 128, "num_dictionaries": 1, "num_feat_extract_layers": 7, "num_hidden_layers": 24, "num_negatives": 100, "output_hidden_size": 1024, "pad_token_id": 1, "proj_codevector_dim": 256, "resnet_relu_type": "prelu", "resnet_weights": null, "sample_rate": 25, "scale_embedding": false, "selection_type": "same_seq", "sim_type": "cosine", "skip_masked": false, "skip_nomask": false, "sub_encoder_layers": 0, "target_glu": false, "tdnn_dilation": [1, 2, 3, 1, 1], "tdnn_dim": [512, 512, 512, 512, 1500], "tdnn_kernel": [5, 3, 3, 1, 1], "torch_dtype": "float32", "transformers_version": "4.44.2", "untie_final_proj": true, "use_cache": true, "use_weighted_layer_sum": false, "vocab_size": 1000, "xvector_output_dim": 512}